---
kind: method
id: M:Autodesk.Revit.DB.Electrical.WireMaterialType.AddGroundConductorSize(System.Int64,System.String)
source: html/21dcbeef-656d-7a93-144a-a4f65f3395c1.htm
---
# Autodesk.Revit.DB.Electrical.WireMaterialType.AddGroundConductorSize Method

Add new electrical ground conductor size type into this material type.

## Syntax (C#)
```csharp
public GroundConductorSize AddGroundConductorSize(
	long ampacity,
	string size
)
```

## Parameters
- **ampacity** (`System.Int64`) - Ampacity of ground conductor size to be added.
- **size** (`System.String`) - Size of ground conductor size to be added.

## Returns
New added ground conductor size.